---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DuplicateFamilyParameterNameWithSharedParameter
source: html/a072b501-ea8c-4bd5-8fb5-3738debb67ef.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DuplicateFamilyParameterNameWithSharedParameter Property

Parameter '[Parameter]' has the same name with an existing shared parameter.

## Syntax (C#)
```csharp
public static FailureDefinitionId DuplicateFamilyParameterNameWithSharedParameter { get; }
```